{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "happy",
    "1": "sad",
    "2": "angry",
    "3": "fear",
    "4": "surprise",
    "5": "neutral"
  },
  "initializer_range": 0.02,
  "label2id": {
    "angry": 2,
    "fear": 3,
    "happy": 0,
    "neutral": 5,
    "sad": 1,
    "surprise": 4
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.3",
  "vocab_size": 30522
}
